blog/app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
  def edit #display form for the existing method,template
    @article=Article.find(params[:id])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "dakiiii"], ["text", "savic"], ["updated_at", "2018-06-03 08:55:44.428618"], ["id", 16]]
---
  def update
    @article=Article.find(params[:id])
        if @article.update_attributes(article_params)